DYXX-X/Library_zh/ESP32_API_zh/hal/esp32s3/include/hal/touch_sensor_ll.h
/*
 * SPDX文件版权文本：2015-2021浓缩咖啡系统（上海）有限公司
 *
 * SPDX许可证标识符：Apache-2.0
 */

/*******************************************************************************
 * 注意ll不是公共api，不要在应用程序代码中使用。请参阅自述文件。在hal/include/hal/readme.md中的md
 ******************************************************************************/

// 触摸传感器的低电平层

#pragma once

#include <stdlib.h>
#include <stdbool.h>
#include "hal/misc.h"
#include "soc/touch_sensor_periph.h"
#include "soc/rtc_cntl_struct.h"
#include "soc/rtc_io_struct.h"
#include "soc/sens_struct.h"
#include "soc/soc_caps.h"
#include "hal/touch_sensor_types.h"

#ifdef __cplusplus
extern "C" {
#endif

#define TOUCH_LL_READ_RAW           0x0
#define TOUCH_LL_READ_BENCHMARK     0x2
#define TOUCH_LL_READ_SMOOTH        0x3
#define TOUCH_LL_TIMER_FORCE_DONE   0x3
#define TOUCH_LL_TIMER_DONE         0x0

/**
 * 设置触摸传感器的充电和放电时间。
 *
 * @param meas_timers 触摸通道的每个测量过程中的充电和放电时间。定时器频率为8Mhz。范围：0~0xffff。
 */
static inline void touch_ll_set_meas_times(uint16_t meas_time)
{
    //触摸通道的每个测量过程中的充电和放电时间。
    HAL_FORCE_MODIFY_U32_REG_FIELD(RTCCNTL.touch_ctrl1, touch_meas_num, meas_time);
    //TOUCH_START和TOUCH_XPD之间的等待周期（8MHz）
    HAL_FORCE_MODIFY_U32_REG_FIELD(RTCCNTL.touch_ctrl2, touch_xpd_wait, SOC_TOUCH_PAD_MEASURE_WAIT_MAX); //等待电压稳定
}

/**
 * 获取触摸传感器的充电和放电时间。
 *
 * @param meas_times 用于接受充电和放电次数计数的指针。
 */
static inline void touch_ll_get_measure_times(uint16_t *meas_time)
{
    *meas_time = HAL_FORCE_READ_U32_REG_FIELD(RTCCNTL.touch_ctrl1, touch_meas_num);
}

/**
 * 设置触摸传感器睡眠时间。
 *
 * @param sleep_cycle  每次测量后，触摸传感器将休眠。sleep_cycle决定每次测量之间的间隔。t_sleep=sleep_cycle/（RTC_SLOW_CLK频率）。RTC_SLOW_CLK的近似频率值可以使用RTC_CLK_SLOW_freq_get_hz函数获得。
 */
static inline void touch_ll_set_sleep_time(uint16_t sleep_time)
{
    // 触摸传感器睡眠周期时间=sleep_cycle/RTC_SLOW_CLK（150k）
    HAL_FORCE_MODIFY_U32_REG_FIELD(RTCCNTL.touch_ctrl1, touch_sleep_cycles, sleep_time);
}

/**
 * 获取触摸传感器睡眠时间。
 *
 * @param sleep_cycle  用于接受睡眠周期号的指针。
 */
static inline void touch_ll_get_sleep_time(uint16_t *sleep_time)
{
    *sleep_time = HAL_FORCE_READ_U32_REG_FIELD(RTCCNTL.touch_ctrl1, touch_sleep_cycles);
}

/**
 * 设置通道的触摸传感器高电压阈值。触摸传感器通过对通道进行充电和放电来测量通道电容值。因此，高阈值应该小于电源电压。
 *
 * @param refh 通道的高电压阈值。
 */
static inline void touch_ll_set_voltage_high(touch_high_volt_t refh)
{
    RTCCNTL.touch_ctrl2.touch_drefh = refh;
}

/**
 * 获取通道的触摸传感器高电压阈值。触摸传感器通过对通道进行充电和放电来测量通道电容值。因此，高阈值应该小于电源电压。
 *
 * @param refh 通道的高电压阈值。
 */
static inline void touch_ll_get_voltage_high(touch_high_volt_t *refh)
{
    *refh = (touch_high_volt_t)RTCCNTL.touch_ctrl2.touch_drefh;
}

/**
 * 设置触摸传感器放电的低电压阈值。触摸传感器通过对通道进行充电和放电来测量通道电容值。
 *
 * @param refl 放电的低电压阈值。
 */
static inline void touch_ll_set_voltage_low(touch_low_volt_t refl)
{
    RTCCNTL.touch_ctrl2.touch_drefl = refl;
}

/**
 * 获取触摸传感器低电压放电阈值。触摸传感器通过对通道进行充电和放电来测量通道电容值。
 *
 * @param refl 放电的低电压阈值。
 */
static inline void touch_ll_get_voltage_low(touch_low_volt_t *refl)
{
    *refl = (touch_low_volt_t)RTCCNTL.touch_ctrl2.touch_drefl;
}

/**
 * 设置触摸传感器的高电压衰减通道。实际充电阈值是高电压阈值减去衰减值。触摸传感器通过对通道进行充电和放电来测量通道电容值。因此，高阈值应该小于电源电压。
 *
 * @param refh 通道的高电压阈值。
 */
static inline void touch_ll_set_voltage_attenuation(touch_volt_atten_t atten)
{
    RTCCNTL.touch_ctrl2.touch_drange = atten;
}

/**
 * 获取触摸传感器的高电压衰减通道。实际充电阈值是高电压阈值减去衰减值。触摸传感器通过对通道进行充电和放电来测量通道电容值。因此，高阈值应该小于电源电压。
 *
 * @param refh 通道的高电压阈值。
 */
static inline void touch_ll_get_voltage_attenuation(touch_volt_atten_t *atten)
{
    *atten = (touch_volt_atten_t)RTCCNTL.touch_ctrl2.touch_drange;
}

/**
 * 为每个极板设置触摸传感器充电/放电速度（电流）。如果斜率为0，计数器将始终为零。如果斜率为1，则充电和放电将缓慢。测量时间变长。如果斜率设置为最大值7，则充电和放电将很快。测量时间变短。
 *
 * @note 充电和放电电流越高，触摸通道的抗扰度越高，但会增加系统功耗。
 * @param touch_num 触摸板索引。
 * @param slope 触摸板充电/放电速度（电流）。
 */
static inline void touch_ll_set_slope(touch_pad_t touch_num, touch_cnt_slope_t slope)
{
    if (touch_num < TOUCH_PAD_NUM10) {
        SET_PERI_REG_BITS(RTC_CNTL_TOUCH_DAC_REG, RTC_CNTL_TOUCH_PAD0_DAC_V, slope, (RTC_CNTL_TOUCH_PAD0_DAC_S - touch_num * 3));
    } else {
        SET_PERI_REG_BITS(RTC_CNTL_TOUCH_DAC1_REG, RTC_CNTL_TOUCH_PAD10_DAC_V, slope, (RTC_CNTL_TOUCH_PAD10_DAC_S - (touch_num - TOUCH_PAD_NUM10) * 3));
    }
}

/**
 * 获取每个极板的触摸传感器充电/放电速度（电流）。如果斜率为0，计数器将始终为零。如果斜率为1，则充电和放电将缓慢。测量时间变长。如果斜率设置为最大值7，则充电和放电将很快。测量时间变短。
 *
 * @param touch_num 触摸板索引。
 * @param slope 触摸板充电/放电速度（电流）。
 */
static inline void touch_ll_get_slope(touch_pad_t touch_num, touch_cnt_slope_t *slope)
{
    if (touch_num < TOUCH_PAD_NUM10) {
        *slope = GET_PERI_REG_BITS2(RTC_CNTL_TOUCH_DAC_REG, RTC_CNTL_TOUCH_PAD0_DAC_V, (RTC_CNTL_TOUCH_PAD0_DAC_S - touch_num * 3));
    } else {
        *slope = GET_PERI_REG_BITS2(RTC_CNTL_TOUCH_DAC1_REG, RTC_CNTL_TOUCH_PAD10_DAC_V, (RTC_CNTL_TOUCH_PAD10_DAC_S - (touch_num - TOUCH_PAD_NUM10) * 3));
    }
}

/**
 * 为每次测量设置触摸通道的初始电压状态。
 *
 * @param touch_num 触摸板索引。
 * @param opt 初始电压状态。
 */
static inline void touch_ll_set_tie_option(touch_pad_t touch_num, touch_tie_opt_t opt)
{
    RTCIO.touch_pad[touch_num].tie_opt = opt;
}

/**
 * 获取每次测量的触摸通道的初始电压状态。
 *
 * @param touch_num 触摸板索引。
 * @param opt 初始电压状态。
 */
static inline void touch_ll_get_tie_option(touch_pad_t touch_num, touch_tie_opt_t *opt)
{
    *opt = (touch_tie_opt_t)RTCIO.touch_pad[touch_num].tie_opt;
}

/**
 * 设置触摸传感器FSM模式。测量动作可以由硬件计时器以及软件指令触发。
 *
 * @param mode FSM模式。
 */
static inline void touch_ll_set_fsm_mode(touch_fsm_mode_t mode)
{
    RTCCNTL.touch_ctrl2.touch_start_force = mode;
}

/**
 * 获取触摸传感器FSM模式。测量动作可以由硬件计时器以及软件指令触发。
 *
 * @param mode FSM模式。
 */
static inline void touch_ll_get_fsm_mode(touch_fsm_mode_t *mode)
{
    *mode = (touch_fsm_mode_t)RTCCNTL.touch_ctrl2.touch_start_force;
}

/**
 * 启用/禁用触摸传感器的时钟门。
 *
 * @param enable 真/假。
 */
static inline void touch_ll_clkgate(bool enable)
{
    RTCCNTL.touch_ctrl2.touch_clkgate_en = enable; //启用FSM的触摸时钟。或强制启用。
}

/**
 * 获取触摸传感器FSM状态。
 * @return
 *          -true：fsm状态为打开。
 *          -false：fsm状态已关闭。
 */
static inline bool touch_ll_clkgate_get_state(void)
{
    return RTCCNTL.touch_ctrl2.touch_clkgate_en;
}

/**
 * 触摸计时器触发测量并始终等待测量完成。触摸计时器的强制完成确保计时器始终可以获得测量完成信号。
 */
static inline void touch_ll_timer_force_done(void)
{
    RTCCNTL.touch_ctrl2.touch_timer_force_done = TOUCH_LL_TIMER_FORCE_DONE;
    RTCCNTL.touch_ctrl2.touch_timer_force_done = TOUCH_LL_TIMER_DONE;
}

/**
 * 启动触摸传感器FSM计时器。测量动作可以由硬件计时器以及软件指令触发。
 */
static inline void touch_ll_start_fsm(void)
{
    /**
     * 触摸计时器触发测量并始终等待测量完成。触摸计时器的强制完成确保计时器始终可以获得测量完成信号。
     */
    RTCCNTL.touch_ctrl2.touch_timer_force_done = TOUCH_LL_TIMER_FORCE_DONE;
    RTCCNTL.touch_ctrl2.touch_timer_force_done = TOUCH_LL_TIMER_DONE;
    RTCCNTL.touch_ctrl2.touch_slp_timer_en = (RTCCNTL.touch_ctrl2.touch_start_force == TOUCH_FSM_MODE_TIMER ? 1 : 0);
}

/**
 * 停止触摸传感器FSM计时器。测量动作可以由硬件计时器以及软件指令触发。
 */
static inline void touch_ll_stop_fsm(void)
{
    RTCCNTL.touch_ctrl2.touch_start_en = 0; //停止触摸fsm
    RTCCNTL.touch_ctrl2.touch_slp_timer_en = 0;
    RTCCNTL.touch_ctrl2.touch_timer_force_done = TOUCH_LL_TIMER_FORCE_DONE;
    RTCCNTL.touch_ctrl2.touch_timer_force_done = TOUCH_LL_TIMER_DONE;
}

/**
 * 获取触摸传感器FSM计时器状态。
 * @return
 *     -true：启用FSM
 *     -false:FSM已禁用
 */
static inline bool touch_ll_get_fsm_state(void)
{
    return (bool)RTCCNTL.touch_ctrl2.touch_slp_timer_en;
}

/**
 * 触发触摸传感器测量，仅支持FSM的SW模式。
 */
static inline void touch_ll_start_sw_meas(void)
{
    RTCCNTL.touch_ctrl2.touch_start_en = 0;
    RTCCNTL.touch_ctrl2.touch_start_en = 1;
}

/**
 * 设置触摸传感器的触发阈值。阈值确定触摸传感器的灵敏度。阈值是触发状态的原始值减去基准值。
 *
 * @note  如果设置为“TOUCH_PAD_THRESHOLD_MAX”，则不会触发触摸。
 * @param touch_num 触摸板索引
 * @param threshold 触摸传感器的阈值。
 */
static inline void touch_ll_set_threshold(touch_pad_t touch_num, uint32_t threshold)
{
    SENS.touch_thresh[touch_num - 1].thresh = threshold;
}

/**
 * 获取触摸传感器的触发阈值。阈值确定触摸传感器的灵敏度。阈值是触发状态的原始值减去基准值。
 *
 * @param touch_num 触摸板索引。
 * @param threshold 接受阈值的指针。
 */
static inline void touch_ll_get_threshold(touch_pad_t touch_num, uint32_t *threshold)
{
    *threshold = SENS.touch_thresh[touch_num - 1].thresh;
}

/**
 * 启用触摸传感器通道。将触摸通道注册到触摸传感器测量组中。触摸传感器的工作模式是同时测量。此函数将根据给定的位掩码设置测量位。
 *
 * @note  如果设置此掩码，则应首先停止FSM计时器。
 * @note  在扫描图中的触摸传感器，应首先取消GPIO功能。
 * @param enable_mask 触摸传感器扫描组的位掩码。e、 g.TOUCH_PAD_NUM1->位（1）
 * @return
 *      -成功时ESP_OK
 */
static inline void touch_ll_set_channel_mask(uint16_t enable_mask)
{
    RTCCNTL.touch_scan_ctrl.touch_scan_pad_map  |= (enable_mask & TOUCH_PAD_BIT_MASK_ALL);
    SENS.sar_touch_conf.touch_outen |= (enable_mask & TOUCH_PAD_BIT_MASK_ALL);
}

/**
 * 获取触摸传感器通道掩码。
 *
 * @param enable_mask 触摸传感器扫描组的位掩码。e、 g.TOUCH_PAD_NUM1->位（1）
 */
static inline void touch_ll_get_channel_mask(uint16_t *enable_mask)
{
    *enable_mask = SENS.sar_touch_conf.touch_outen \
                   & RTCCNTL.touch_scan_ctrl.touch_scan_pad_map \
                   & TOUCH_PAD_BIT_MASK_ALL;
}

/**
 * 通过位掩码禁用触摸传感器通道。
 *
 * @param enable_mask 触摸传感器扫描组的位掩码。e、 g.TOUCH_PAD_NUM1->位（1）
 */
static inline void touch_ll_clear_channel_mask(uint16_t disable_mask)
{
    SENS.sar_touch_conf.touch_outen &= ~(disable_mask & TOUCH_PAD_BIT_MASK_ALL);
    RTCCNTL.touch_scan_ctrl.touch_scan_pad_map  &= ~(disable_mask & TOUCH_PAD_BIT_MASK_ALL);
}

/**
 * 获取触摸传感器触发状态，通常用于ISR中，以确定哪些焊盘被“触摸”。
 *
 * @param status_mask 触摸传感器状态。e、 g.触摸1触发状态为“status_mask&（BIT1）”。
 */
static inline void touch_ll_read_trigger_status_mask(uint32_t *status_mask)
{
    *status_mask = SENS.sar_touch_chn_st.touch_pad_active;
}

/**
 * 清除所有触摸传感器状态。
 *
 * @note 通常不需要手动拆卸。
 */
static inline void touch_ll_clear_trigger_status_mask(void)
{
    SENS.sar_touch_conf.touch_status_clr = 1;
}

/**
 * 从寄存器中获取触摸传感器原始数据（触摸传感器计数器值）。没有障碍。
 *
 * @param touch_num 触摸板索引。
 * @return 用于接受触摸传感器值的touch_value指针。
 */
static inline uint32_t IRAM_ATTR touch_ll_read_raw_data(touch_pad_t touch_num)
{
    SENS.sar_touch_conf.touch_data_sel = TOUCH_LL_READ_RAW;
    return SENS.sar_touch_status[touch_num - 1].touch_pad_data;
}

/**
 * 获取触摸传感器测量状态。没有障碍。
 *
 * @return
 *      -如果触摸传感器测量完成。
 */
static inline bool touch_ll_meas_is_done(void)
{
    return (bool)SENS.sar_touch_chn_st.touch_meas_done;
}

