DYXX-X/Library_zh/ESP32_API_zh/hal/esp32s3/include/hal/touch_sensor_ll.h
/*************************仅限esp32s2*************************/

/**
 * 重置整个触摸模块。
 *
 * @note 在“touch_pad_fsm_stop”之后调用此函数。
 */
static inline void touch_ll_reset(void)
{
    RTCCNTL.touch_ctrl2.touch_reset = 0;
    RTCCNTL.touch_ctrl2.touch_reset = 1;
    RTCCNTL.touch_ctrl2.touch_reset = 0;    // 应设置为0。
}

/**
 * 将触摸通道的连接类型设置为空闲状态。当信道处于测量模式时，其他初始化信道处于空闲模式。触摸通道通常与迹线相邻，因此空闲通道的连接状态影响测试通道的稳定性和灵敏度。“CONN_HIGHZ”（高电阻）设置增加了触摸通道的灵敏度。“CONN_GND”（接地）设置提高了触摸通道的稳定性。
 *
 * @param type  选择空闲通道连接到高电阻状态或接地。
 */
static inline void touch_ll_set_idle_channel_connect(touch_pad_conn_type_t type)
{
    RTCCNTL.touch_scan_ctrl.touch_inactive_connection = type;
}

/**
 * 将触摸通道的连接类型设置为空闲状态。当信道处于测量模式时，其他初始化信道处于空闲模式。触摸通道通常与迹线相邻，因此空闲通道的连接状态影响测试通道的稳定性和灵敏度。“CONN_HIGHZ”（高电阻）设置增加了触摸通道的灵敏度。“CONN_GND”（接地）设置提高了触摸通道的稳定性。
 *
 * @param type  选择空闲通道连接到高电阻状态或接地。
 */
static inline void touch_ll_get_idle_channel_connect(touch_pad_conn_type_t *type)
{
    *type = RTCCNTL.touch_scan_ctrl.touch_inactive_connection;
}

/**
 * 获取当前测量通道。触摸传感器测量为循环扫描模式。
 *
 * @return
 *      -触摸通道编号
 */
static inline touch_pad_t IRAM_ATTR touch_ll_get_current_meas_channel(void)
{
    return (touch_pad_t)(SENS.sar_touch_status0.touch_scan_curr);
}

/**
 * 通过位掩码启用触摸传感器中断。
 *
 * @param type 中断类型
 */
static inline void touch_ll_intr_enable(touch_pad_intr_mask_t int_mask)
{
    if (int_mask & TOUCH_PAD_INTR_MASK_DONE) {
        RTCCNTL.int_ena_w1ts.rtc_touch_done_w1ts = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_ACTIVE) {
        RTCCNTL.int_ena_w1ts.rtc_touch_active_w1ts = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_INACTIVE) {
        RTCCNTL.int_ena_w1ts.rtc_touch_inactive_w1ts = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_SCAN_DONE) {
        RTCCNTL.int_ena_w1ts.rtc_touch_scan_done_w1ts = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_TIMEOUT) {
        RTCCNTL.int_ena_w1ts.rtc_touch_timeout_w1ts = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_PROXI_MEAS_DONE) {
        RTCCNTL.int_ena_w1ts.rtc_touch_approach_loop_done_w1ts = 1;
    }
}

/**
 * 通过位掩码禁用触摸传感器中断。
 *
 * @param type 中断类型
 */
static inline void touch_ll_intr_disable(touch_pad_intr_mask_t int_mask)
{
    if (int_mask & TOUCH_PAD_INTR_MASK_DONE) {
        RTCCNTL.int_ena_w1tc.rtc_touch_done_w1tc = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_ACTIVE) {
        RTCCNTL.int_ena_w1tc.rtc_touch_active_w1tc = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_INACTIVE) {
        RTCCNTL.int_ena_w1tc.rtc_touch_inactive_w1tc = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_SCAN_DONE) {
        RTCCNTL.int_ena_w1tc.rtc_touch_scan_done_w1tc = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_TIMEOUT) {
        RTCCNTL.int_ena_w1tc.rtc_touch_timeout_w1tc = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_PROXI_MEAS_DONE) {
        RTCCNTL.int_ena_w1tc.rtc_touch_approach_loop_done_w1tc = 1;
    }
}

/**
 * 通过位掩码清除触摸传感器中断。
 *
 * @param int_mask 清除中断的键盘掩码
 */
static inline void touch_ll_intr_clear(touch_pad_intr_mask_t int_mask)
{
    if (int_mask & TOUCH_PAD_INTR_MASK_DONE) {
        RTCCNTL.int_clr.rtc_touch_done = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_ACTIVE) {
        RTCCNTL.int_clr.rtc_touch_active = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_INACTIVE) {
        RTCCNTL.int_clr.rtc_touch_inactive = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_SCAN_DONE) {
        RTCCNTL.int_clr.rtc_touch_scan_done = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_TIMEOUT) {
        RTCCNTL.int_clr.rtc_touch_timeout = 1;
    }
    if (int_mask & TOUCH_PAD_INTR_MASK_PROXI_MEAS_DONE) {
        RTCCNTL.int_clr.rtc_touch_approach_loop_done = 1;
    }
}

/**
 * 获取触摸传感器中断状态的位掩码。
 *
 * @return 类型中断类型
 */
static inline uint32_t touch_ll_read_intr_status_mask(void)
{
    uint32_t intr_st = RTCCNTL.int_st.val;
    uint32_t intr_msk = 0;

    if (intr_st & RTC_CNTL_TOUCH_DONE_INT_ST_M) {
        intr_msk |= TOUCH_PAD_INTR_MASK_DONE;
    }
    if (intr_st & RTC_CNTL_TOUCH_ACTIVE_INT_ST_M) {
        intr_msk |= TOUCH_PAD_INTR_MASK_ACTIVE;
    }
    if (intr_st & RTC_CNTL_TOUCH_INACTIVE_INT_ST_M) {
        intr_msk |= TOUCH_PAD_INTR_MASK_INACTIVE;
    }
    if (intr_st & RTC_CNTL_TOUCH_SCAN_DONE_INT_ST_M) {
        intr_msk |= TOUCH_PAD_INTR_MASK_SCAN_DONE;
    }
    if (intr_st & RTC_CNTL_TOUCH_TIMEOUT_INT_ST_M) {
        intr_msk |= TOUCH_PAD_INTR_MASK_TIMEOUT;
    }
    if (intr_st & RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ST_M) {
        intr_msk |= TOUCH_PAD_INTR_MASK_PROXI_MEAS_DONE;
    }
    return (intr_msk & TOUCH_PAD_INTR_MASK_ALL);
}

/**
 * 启用所有触摸传感器通道测量的超时检查。当触摸通道的触摸读数超过测量阈值时，如果启用：将产生超时中断，并进入下一个通道测量。如果禁用：FSM始终在信道上，直到该信道的测量结束。
 *
 * @note 在启用超时阈值之前，请正确设置超时阈值。
 */
static inline void touch_ll_timeout_enable(void)
{
    RTCCNTL.touch_timeout_ctrl.touch_timeout_en = 1;
}

/**
 * 禁用所有触摸传感器通道测量的超时检查。当触摸通道的触摸读数超过测量阈值时，如果启用：将产生超时中断，并进入下一个通道测量。如果禁用：FSM始终在信道上，直到该信道的测量结束。
 *
 * @note 在启用超时阈值之前，请正确设置超时阈值。
 */
static inline void touch_ll_timeout_disable(void)
{
    RTCCNTL.touch_timeout_ctrl.touch_timeout_en = 0;
}

/**
 * 为所有触摸传感器通道测量设置超时阈值。与触摸读数相比。
 *
 * @param threshold 设置为在一个通道上测量的最大时间。
 */
static inline void touch_ll_timeout_set_threshold(uint32_t threshold)
{
    RTCCNTL.touch_timeout_ctrl.touch_timeout_num = threshold;
}

/**
 * 获取所有触摸传感器通道测量的超时阈值。与触摸读数相比。
 *
 * @param threshold 指向超时阈值。
 */
static inline void touch_ll_timeout_get_threshold(uint32_t *threshold)
{
    *threshold = RTCCNTL.touch_timeout_ctrl.touch_timeout_num;
}

/************************过滤器寄存器设置************************/

/**
 * 获取通过过滤原始数据获得的平滑数据。
 *
 * @param touch_num 触摸板索引
 * @param smooth_data 平滑数据指针
 */
static inline void IRAM_ATTR touch_ll_filter_read_smooth(touch_pad_t touch_num, uint32_t *smooth_data)
{
    SENS.sar_touch_conf.touch_data_sel = TOUCH_LL_READ_SMOOTH;
    *smooth_data = SENS.sar_touch_status[touch_num - 1].touch_pad_data;
}

/**
 * 获取触摸传感器的基准值。
 *
 * @note 初始化后，基准值为第一个测量周期内的最大值。
 * @param touch_num 触摸板索引
 * @param touch_value 接受触摸传感器值的指针
 */
static inline void IRAM_ATTR touch_ll_read_benchmark(touch_pad_t touch_num, uint32_t *benchmark)
{
    SENS.sar_touch_conf.touch_data_sel = TOUCH_LL_READ_BENCHMARK;
    *benchmark = SENS.sar_touch_status[touch_num - 1].touch_pad_data;
}

/**
 * 强制将基准重置为触摸传感器的原始数据。
 *
 * @note 如果调用此API，请确保首先启用时钟门（`touch_ll_clkgate`）。
 * @param touch_num 触摸板索引
 *                  -TOUCH_PAD_MAX重置所有通道的基线。
 */
static inline void touch_ll_reset_benchmark(touch_pad_t touch_num)
{
    /* 清除触摸通道以初始化通道值（基准、raw_data）。
     */
    if (touch_num == TOUCH_PAD_MAX) {
        SENS.sar_touch_chn_st.touch_channel_clr = TOUCH_PAD_BIT_MASK_ALL;
    } else {
        SENS.sar_touch_chn_st.touch_channel_clr = (1U << touch_num);
    }
}

/**
 * 设置过滤器模式。滤波器的输入是触摸读数的原始值，滤波器的输出涉及触摸状态的判断。
 *
 * @param mode 过滤器模式类型。请参阅`touch_filter_mode_t``。
 */
static inline void touch_ll_filter_set_filter_mode(touch_filter_mode_t mode)
{
    RTCCNTL.touch_filter_ctrl.touch_filter_mode = mode;
}

/**
 * 获取过滤器模式。滤波器的输入是触摸读数的原始值，滤波器的输出涉及触摸状态的判断。
 *
 * @param mode 过滤器模式类型。请参阅`touch_filter_mode_t``。
 */
static inline void touch_ll_filter_get_filter_mode(touch_filter_mode_t *mode)
{
    *mode = (touch_filter_mode_t)RTCCNTL.touch_filter_ctrl.touch_filter_mode;
}

/**
 * 设置过滤器模式。滤波器的输入是原始数据，输出是平滑数据。平滑数据用于确定触摸状态。
 *
 * @param mode 过滤器模式类型。请参阅“touch_smooth_mode_t”。
 */
static inline void touch_ll_filter_set_smooth_mode(touch_smooth_mode_t mode)
{
    RTCCNTL.touch_filter_ctrl.touch_smooth_lvl = mode;
}

/**
 * 获取过滤器模式。平滑数据用于确定触摸状态。
 *
 * @param mode 过滤器模式类型。请参阅“touch_smooth_mode_t”。
 */
static inline void touch_ll_filter_get_smooth_mode(touch_smooth_mode_t *mode)
{
    *mode = RTCCNTL.touch_filter_ctrl.touch_smooth_lvl;
}

/**
 * 设置反跳计数，如“n”。如果测量值持续超过阈值“n+1”次，则确定触摸传感器状态改变。
 *
 * @param dbc_cnt 取消跳动计数值。
 */
static inline void touch_ll_filter_set_debounce(uint32_t dbc_cnt)
{
    RTCCNTL.touch_filter_ctrl.touch_debounce = dbc_cnt;
}

/**
 * 获取防抖计数。
 *
 * @param dbc_cnt 取消跳动计数值。
 */
static inline void touch_ll_filter_get_debounce(uint32_t *dbc_cnt)
{
    *dbc_cnt = RTCCNTL.touch_filter_ctrl.touch_debounce;
}

/**
 * 设置噪声阈值系数。更高=抗噪音能力更强。实际噪声应小于（噪声系数触摸阈值）。范围：0~3。系数为0:4/8；1: 3/8; 2: 2/8; 3: 1;
 *
 * @param hys_thr 噪声阈值系数。
 */
static inline void touch_ll_filter_set_noise_thres(uint32_t noise_thr)
{
    RTCCNTL.touch_filter_ctrl.touch_noise_thres = noise_thr;
    RTCCNTL.touch_filter_ctrl.config2 = noise_thr;
    RTCCNTL.touch_filter_ctrl.config1 = 0xF;
    RTCCNTL.touch_filter_ctrl.config3 = 2;
}

/**
 * 获取噪声阈值系数。更高=抗噪音能力更强。实际噪声应小于（噪声系数触摸阈值）。范围：0~3。系数为0:4/8；1: 3/8; 2: 2/8; 3: 1;
 *
 * @param noise_thr 噪声阈值系数。
 */
static inline void touch_ll_filter_get_noise_thres(uint32_t *noise_thr)
{
    *noise_thr = RTCCNTL.touch_filter_ctrl.touch_noise_thres;
}

/**
 * 设置抖动滤波器步长。如果滤波器模式为抖动，应设置抖动的滤波器步长。范围：0~15
 *
 * @param step 数据的步长更改。
 */
static inline void touch_ll_filter_set_jitter_step(uint32_t step)
{
    RTCCNTL.touch_filter_ctrl.touch_jitter_step = step;
}

/**
 * 获取抖动滤波器步长。如果滤波器模式为抖动，应设置抖动的滤波器步长。范围：0~15
 *
 * @param step 数据的步长更改。
 */
static inline void touch_ll_filter_get_jitter_step(uint32_t *step)
{
    *step = RTCCNTL.touch_filter_ctrl.touch_jitter_step;
}

/**
 * 启用触摸传感器过滤器和检测算法。有关检测算法的更多详细信息，请参阅应用程序文档。
 */
static inline void touch_ll_filter_enable(void)
{
    RTCCNTL.touch_filter_ctrl.touch_filter_en = 1;
}

/**
 * 禁用触摸传感器过滤器和检测算法。有关检测算法的更多详细信息，请参阅应用程序文档。
 */
static inline void touch_ll_filter_disable(void)
{
    RTCCNTL.touch_filter_ctrl.touch_filter_en = 0;
}

/************************去噪寄存器设置************************/

/**
 * 启用降噪功能。T0是不具有相应外部GPIO的内部通道。T0将与测量的信道Tn同时工作。最后，Tn的实际测量值是减去T0的低位后的值。此去噪功能可滤除所有信道上引入的干扰，例如电源和外部EMI引入的噪声。
 */
static inline void touch_ll_denoise_enable(void)
{
    RTCCNTL.touch_scan_ctrl.touch_denoise_en = 1;
}

/**
 * 启用降噪功能。T0是不具有相应外部GPIO的内部通道。T0将与测量的信道Tn同时工作。最后，Tn的实际测量值是减去T0的低位后的值。此去噪功能可滤除所有信道上引入的干扰，例如电源和外部EMI引入的噪声。
 */
static inline void touch_ll_denoise_disable(void)
{
    RTCCNTL.touch_scan_ctrl.touch_denoise_en = 0;
}

/**
 * 设置降噪通道的内部参考电容。选择适当的内部参考电容值，使去噪通道的读数最接近被测通道的读数。
 *
 * @param cap_level 电容水平。
 */
static inline void touch_ll_denoise_set_cap_level(touch_pad_denoise_cap_t cap_level)
{
    RTCCNTL.touch_ctrl2.touch_refc = cap_level;
}

/**
 * 获得去噪通道的内部参考电容。选择适当的内部参考电容值，使去噪通道的读数最接近被测通道的读数。
 *
 * @param cap_level 电容水平。
 */
static inline void touch_ll_denoise_get_cap_level(touch_pad_denoise_cap_t *cap_level)
{
    *cap_level = RTCCNTL.touch_ctrl2.touch_refc;
}

/**
 * 设置去噪通道的去噪范围。通过测量去噪信道的噪声幅度来确定。
 *
 * @param grade 去噪通道的去噪范围。
 */
static inline void touch_ll_denoise_set_grade(touch_pad_denoise_grade_t grade)
{
    RTCCNTL.touch_scan_ctrl.touch_denoise_res = grade;
}

/**
 * 设置去噪通道的去噪范围。通过测量去噪信道的噪声幅度来确定。
 *
 * @param grade 去噪通道的去噪范围。
 */
static inline void touch_ll_denoise_get_grade(touch_pad_denoise_grade_t *grade)
{
    *grade = RTCCNTL.touch_scan_ctrl.touch_denoise_res;
}

/**
 * 读取去噪测量值（TOUCH_PAD_NUM0）。
 *
 * @param denoise 去噪值。
 */
static inline void touch_ll_denoise_read_data(uint32_t *data)
{
    *data =  SENS.sar_touch_denoise.touch_denoise_data;
}

/************************防水寄存器设置************************/

/**
 * 设置保护板的触摸通道使用。
 *
 * @param pad_num 触摸传感器通道编号。
 */
static inline void touch_ll_waterproof_set_guard_pad(touch_pad_t pad_num)
{
    RTCCNTL.touch_scan_ctrl.touch_out_ring = pad_num;
}

/**
 * 获得用于保护垫的触摸通道。
 *
 * @param pad_num 触摸传感器通道编号。
 */
static inline void touch_ll_waterproof_get_guard_pad(touch_pad_t *pad_num)
{
    *pad_num = RTCCNTL.touch_scan_ctrl.touch_out_ring;
}

/**
 * 设置屏蔽通道的最大等效电容。屏蔽通道的等效电容可以从去噪通道的读数中计算出来。
 *
 * @param pad_num 触摸传感器通道编号。
 */
static inline void touch_ll_waterproof_set_sheild_driver(touch_pad_shield_driver_t driver_level)
{
    RTCCNTL.touch_scan_ctrl.touch_bufdrv = driver_level;
}

/**
 * 获取屏蔽通道的最大等效电容。屏蔽通道的等效电容可以从去噪通道的读数中计算出来。
 *
 * @param pad_num 触摸传感器通道编号。
 */
static inline void touch_ll_waterproof_get_sheild_driver(touch_pad_shield_driver_t *driver_level)
{
    *driver_level = RTCCNTL.touch_scan_ctrl.touch_bufdrv;
}

/**
 * 启用防水功能参数。
 *
 * 防水功能包括屏蔽信道（TOUCH_PAD_NUM14）和保护信道。保护垫用于检测覆盖触摸面板的大面积水。屏蔽垫用于屏蔽覆盖触摸面板的水滴的影响。它通常设计为网格，并放置在触摸按钮周围。
 */
static inline void touch_ll_waterproof_enable(void)
{
    RTCCNTL.touch_scan_ctrl.touch_shield_pad_en = 1;
}

/**
 * 禁用防水功能参数。
 */
static inline void touch_ll_waterproof_disable(void)
{
    RTCCNTL.touch_scan_ctrl.touch_shield_pad_en = 0;
}

