DYXX-X/Library_zh/ESP32_API_zh/hal/esp32s3/include/hal/touch_sensor_ll.h
/************************接近寄存器设置************************/

/**
 * 设置接近板的触摸通道编号。如果禁用接近焊盘，请将该焊盘指向`TOUCH_pad_NUM0`
 *
 * @param prox_pad 三个接近焊盘的阵列。
 */
static inline void touch_ll_proximity_set_channel_num(const touch_pad_t prox_pad[])
{
    SENS.sar_touch_conf.touch_approach_pad0 = prox_pad[0];
    SENS.sar_touch_conf.touch_approach_pad1 = prox_pad[1];
    SENS.sar_touch_conf.touch_approach_pad2 = prox_pad[2];
}

/**
 * 获取接近板的触摸通道编号。如果禁用接近焊盘，请将该焊盘指向`TOUCH_pad_NUM0`
 *
 * @param prox_pad 三个接近焊盘的阵列。
 */
static inline void touch_ll_proximity_get_channel_num(touch_pad_t prox_pad[])
{
    prox_pad[0] = SENS.sar_touch_conf.touch_approach_pad0;
    prox_pad[1] = SENS.sar_touch_conf.touch_approach_pad1;
    prox_pad[2] = SENS.sar_touch_conf.touch_approach_pad2;
}

/**
 * 设置接近板的累计测量时间。
 *
 * @param times 累计测量周期数。
 */
static inline void touch_ll_proximity_set_meas_times(uint32_t times)
{
    HAL_FORCE_MODIFY_U32_REG_FIELD(RTCCNTL.touch_approach, touch_approach_meas_time, times);
}

/**
 * 获取接近板的累计测量时间。
 *
 * @param times 累计测量周期数。
 */
static inline void touch_ll_proximity_get_meas_times(uint32_t *times)
{
    *times = HAL_FORCE_READ_U32_REG_FIELD(RTCCNTL.touch_approach, touch_approach_meas_time);
}

/**
 * 读取接近焊盘的当前累计测量时间。
 *
 * @param times 累计测量周期数。
 */
static inline void touch_ll_proximity_read_meas_cnt(touch_pad_t touch_num, uint32_t *cnt)
{
    if (SENS.sar_touch_conf.touch_approach_pad0 == touch_num) {
        *cnt = SENS.sar_touch_appr_status.touch_approach_pad0_cnt;
    } else if (SENS.sar_touch_conf.touch_approach_pad1 == touch_num) {
        *cnt = SENS.sar_touch_appr_status.touch_approach_pad1_cnt;
    } else if (SENS.sar_touch_conf.touch_approach_pad2 == touch_num) {
        *cnt = SENS.sar_touch_appr_status.touch_approach_pad2_cnt;
    }
}

/**
 * 检查触摸传感器通道是否为接近板。
 *
 * @param touch_num 触摸传感器通道编号。
 */
static inline bool touch_ll_proximity_pad_check(touch_pad_t touch_num)
{
    if ((SENS.sar_touch_conf.touch_approach_pad0 != touch_num)
            && (SENS.sar_touch_conf.touch_approach_pad1 != touch_num)
            && (SENS.sar_touch_conf.touch_approach_pad2 != touch_num)) {
        return false;
    } else {
        return true;
    }
}

/**************睡眠垫设置***********************/

/**
 * 设置睡眠板的触摸通道编号。
 *
 * @note 深度睡眠模式下仅支持一个触摸传感器通道。
 * @param touch_num 触摸传感器通道编号。
 */
static inline void touch_ll_sleep_set_channel_num(touch_pad_t touch_num)
{
    RTCCNTL.touch_slp_thres.touch_slp_pad = touch_num;
}

/**
 * 获取睡眠板的触摸通道编号。
 *
 * @note 深度睡眠模式下仅支持一个触摸传感器通道。
 * @param touch_num 触摸传感器通道编号。
 */
static inline void touch_ll_sleep_get_channel_num(touch_pad_t *touch_num)
{
    *touch_num = RTCCNTL.touch_slp_thres.touch_slp_pad;
}

/**
 * 设置深度睡眠中触摸传感器的触发阈值。阈值确定触摸传感器的灵敏度。阈值是触发状态的原始值减去基准值。
 *
 * @note 通常，睡眠期间的触摸阈值可以使用睡眠之前的阈值参数参数。
 */
static inline void touch_ll_sleep_set_threshold(uint32_t touch_thres)
{
    RTCCNTL.touch_slp_thres.touch_slp_th = touch_thres;
}

/**
 * 获取深度睡眠中触摸传感器的触发阈值。阈值确定触摸传感器的灵敏度。阈值是触发状态的原始值减去基准值。
 *
 * @note 通常，睡眠期间的触摸阈值可以使用睡眠之前的阈值参数参数。
 */
static inline void touch_ll_sleep_get_threshold(uint32_t *touch_thres)
{
    *touch_thres = RTCCNTL.touch_slp_thres.touch_slp_th;
}

/**
 * 启用睡眠垫的接近功能。
 */
static inline void touch_ll_sleep_enable_approach(void)
{
    RTCCNTL.touch_slp_thres.touch_slp_approach_en = 1;
}

/**
 * 禁用睡眠垫的接近功能。
 */
static inline void touch_ll_sleep_disable_approach(void)
{
    RTCCNTL.touch_slp_thres.touch_slp_approach_en = 0;
}

/**
 * 获取睡眠垫的接近功能状态。
 */
static inline bool touch_ll_sleep_get_approach_status(void)
{
    return (bool)RTCCNTL.touch_slp_thres.touch_slp_approach_en;
}

/**
 * 读取睡眠垫触摸传感器的基准。
 *
 * @param benchmark 用于接受触摸传感器基准值的指针。
 */
static inline void touch_ll_sleep_read_benchmark(uint32_t *benchmark)
{
    SENS.sar_touch_conf.touch_data_sel = TOUCH_LL_READ_BENCHMARK;
    *benchmark = SENS.sar_touch_slp_status.touch_slp_data;
}

static inline void touch_ll_sleep_read_smooth(uint32_t *smooth_data)
{
    SENS.sar_touch_conf.touch_data_sel = TOUCH_LL_READ_SMOOTH;
    *smooth_data = SENS.sar_touch_slp_status.touch_slp_data;
}

/* 解决方法：注意：睡眠板原始数据不在“sar_touch_slp_status”中*/
static inline void touch_ll_sleep_read_data(uint32_t *raw_data)
{
    uint32_t touch_num = RTCCNTL.touch_slp_thres.touch_slp_pad;
    SENS.sar_touch_conf.touch_data_sel = TOUCH_LL_READ_RAW;
    *raw_data = SENS.sar_touch_status[touch_num - 1].touch_pad_data;
}

static inline void touch_ll_sleep_reset_benchmark(void)
{
    RTCCNTL.touch_approach.touch_slp_channel_clr = 1;
}

/**
 * 选择触摸传感器dbias以在睡眠模式下省电。
 *
 * @note 如果改变dbias，触摸传感器的读数将改变。用户应确保阈值。
 */
static inline void touch_ll_sleep_low_power(bool is_low_power)
{
    RTCCNTL.touch_ctrl2.touch_dbias = is_low_power;
}

/**
 * 读取睡眠垫触摸传感器的防抖。
 *
 * @param debounce 用于接受触摸传感器反跳值的指针。
 */
static inline void touch_ll_sleep_read_debounce(uint32_t *debounce)
{
    *debounce = SENS.sar_touch_slp_status.touch_slp_debounce;
}

/**
 * 读取睡眠垫触摸传感器的接近计数。
 * @param proximity_cnt 用于接受触摸传感器接近计数值的指针。
 */
static inline void touch_ll_sleep_read_proximity_cnt(uint32_t *approach_cnt)
{
    *approach_cnt = SENS.sar_touch_appr_status.touch_slp_approach_cnt;
}

/**
 * 获取导致从深度睡眠中醒来的触摸板。
 *
 * @param pad_num 导致唤醒的触摸板指针。
 */
static inline void touch_ll_get_wakeup_status(touch_pad_t *pad_num)
{
    *pad_num = (touch_pad_t)RTCCNTL.touch_slp_thres.touch_slp_pad;
}

#ifdef __cplusplus
}
#endif

